In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2101213030:stu2101213030@162.105.146.37:53306

In [3]:
%sql use stu2101213030;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.

[]

In [4]:
%sql show tables;

 * mysql://stu2101213030:***@162.105.146.37:53306
2 rows affected.

[('client',), ('finances_product',)]

假设A市C银行为了方便对银行数据的管理和操作，引入了数据库。针对C银行的业务，本实验主要将对象分为客户、银行卡、理财产品、
保险和基金。因此，针对这些数据库对象，本实验假设C银行的金融数据库存在着以下关系：客户可以办理银行卡，同时客户可以购买不同的银行产品，
如理财产品，基金和保险。那么，根据C银行的对象关系，本实验给出了相应的关系模式和ER图，并对其进行较为复杂的数据库操作。

对于C银行中的5个对象，分别建立属于每个对象的属性集合，具体属性描述如下：
	客户（客户编号、客户名称、客户邮箱，客户身份证，客户手机号，客户登录密码）
	银行卡（银行卡号，银行卡类型）
	理财产品（产品名称，产品编号，产品描述，购买金额，理财年限）
	保险（保险名称，保险编号，保险金额，适用人群，保险年限，保障项目）
	基金（基金名称，基金编号，基金类型，基金金额，风险等级，基金管理者）
对象之间的关系：
	一个客户可以办理多张银行卡
	一个客户可以购买多个理财产品，同一类理财产品可由多个客户购买
	一个客户可以购买多个基金，同一类基金可由多个客户购买
	一个客户可以购买多个保险，同一类保险可由多个客户购买

##说明
	由于一个客户可以办理多张银行卡，所以银行卡表引用客户表的客户编号作为外键。
	由于一个客户可以购买多个理财产品，同一类理财产品可由多个客户购买。所以生成关系表——资产表。资产表引用客户表的商品编号作为外键，引用理财产品表的产品编号作为外键，并且添加商品状态、商品数量、商品收益和购买时间等属性。
	客户和保险、客户和基金的关系同理，所以资产表同样作为生成的关系表，修改资产表的理财产品编号为商品编号，商品编号引用自理财产品表、保险和基金表的编号。

对象及属性对应的编号为：
	Client(c_id，c_name，c_mail，c_id_card，c_phone，c_password)
	bank_card(b_number，b_type，b_c_id)
	finances_product(p_name，p_id，p_description，p_amount，p_year)
	insurance(i_name，i_id，i_amount，i_person，i_year，i_project)
	fund(f_name，f_id，f_type，f_amount，risk_level，f_manager)
	property(pro_id,pro_c_id，pro_pif_id，pro_type，pro_status，pro_quantity，pro_income，pro_purchase_time)
说明：
	资产表（property）中由于商品编号(pro_pif_id)字段引用自理财产品表、保险和基金表的id字段，为了防止三商品的id字段相互冲突，添加商品类型(pro_type)字段区分三种商品。并且资产表添加资产编号(pro_id)字段作为主键。

In [5]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

# 如果数据表已经存在则删除表
# 创建client表
drop table if exists client;

CREATE TABLE client
(
    c_id INT PRIMARY KEY,
    c_name VARCHAR(100) NOT NULL,
    c_mail CHAR(30) UNIQUE,
    c_id_card CHAR(20) UNIQUE NOT NULL,
    c_phone CHAR(20) UNIQUE NOT NULL,
    c_password CHAR(20) NOT NULL
);
set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

# 创建bank_card表
drop table if exists bank_card;

CREATE TABLE bank_card
(
    b_number CHAR(30) PRIMARY KEY,
    b_type CHAR(20),
    b_c_id INT NOT NULL
);

set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

# 创建finances_product表
drop table if exists finances_product;

CREATE TABLE finances_product
(
    p_name VARCHAR(100) NOT NULL,
    p_id INT PRIMARY KEY,
    p_description VARCHAR(4000),
    p_amount INT,
    p_year INT
);
set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;


# 创建insurance表
drop table if exists insurance;

CREATE TABLE insurance
(
    i_name VARCHAR(100) NOT NULL,
    i_id INT PRIMARY KEY,
    i_amount INT,
    i_person CHAR(20),
    i_year INT,
    i_project VARCHAR(200)
);

set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [9]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;


# 创建fund表
drop table if exists fund;

CREATE TABLE fund
(
    f_name VARCHAR(100) NOT NULL,
    f_id INT PRIMARY KEY,
    f_type CHAR(20),
    f_amount INT,
    risk_level CHAR(20) NOT NULL,
    f_manager INT NOT NULL
);

set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;


# 创建property表
drop table if exists property;

CREATE TABLE property
(
    pro_id INT PRIMARY KEY,
    pro_c_id INT NOT NULL,
    pro_pif_id INT NOT NULL,
    pro_type INT NOT NULL,
    pro_status CHAR(20),
    pro_quantity INT,
    pro_income INT,
    pro_purchase_time DATE
);

set @@foreign_key_checks=1;

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [11]:
%%sql

/*对表添加外键约束，在银行信息表和资产信息表中，都存在每个银行卡必须有一个持卡者、
每份资产必须都有一个资产拥有者这样的对应关系。因此针对这种对应关系，创建外键约束。*/

ALTER TABLE bank_card ADD CONSTRAINT fk_c_id FOREIGN KEY (b_c_id) REFERENCES client(c_id) ON DELETE CASCADE;

#同上
ALTER TABLE property ADD CONSTRAINT fk_pro_c_id FOREIGN KEY (pro_c_id) REFERENCES client(c_id) ON DELETE CASCADE;

#步骤 2	在理财产品表、保险信息表和基金信息表中，都存在金额这个属性，在现实生活中，金额不会存在负数。因此针对表中金额的属性，增加大于0的约束条件。
#为finances_product表的p_amount列添加大于等于0的约束。
ALTER table finances_product ADD CONSTRAINT c_p_mount CHECK (p_amount >=0);

#为fund表的f_amount列添加大于等于0的约束。
ALTER table fund ADD CONSTRAINT c_f_mount CHECK (f_amount >=0);

#为insurance表的i_amount列添加大于等于0的约束。
ALTER table insurance ADD CONSTRAINT c_i_mount CHECK (i_amount >=0);

 * mysql://stu2101213030:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
/*client*/
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (1,'张一','zhangyi@huawei.com','340211199301010001','18815650001','gaussdb_001');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (2,'张二','zhanger@huawei.com','340211199301010002','18815650002','gaussdb_002');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (3,'张三','zhangsan@huawei.com','340211199301010003','18815650003','gaussdb_003');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (4,'张四','zhangsi@huawei.com','340211199301010004','18815650004','gaussdb_004');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (5,'张五','zhangwu@huawei.com','340211199301010005','18815650005','gaussdb_005');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (6,'张六','zhangliu@huawei.com','340211199301010006','18815650006','gaussdb_006');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (7,'张七','zhangqi@huawei.com','340211199301010007','18815650007','gaussdb_007');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (8,'张八','zhangba@huawei.com','340211199301010008','18815650008','gaussdb_008');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (9,'张九','zhangjiu@huawei.com','340211199301010009','18815650009','gaussdb_009');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (10,'李一','liyi@huawei.com','340211199301010010','18815650010','gaussdb_010');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (11,'李二','lier@huawei.com','340211199301010011','18815650011','gaussdb_011');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (12,'李三','lisan@huawei.com','340211199301010012','18815650012','gaussdb_012');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (13,'李四','lisi@huawei.com','340211199301010013','18815650013','gaussdb_013');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (14,'李五','liwu@huawei.com','340211199301010014','18815650014','gaussdb_014');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (15,'李六','liliu@huawei.com','340211199301010015','18815650015','gaussdb_015');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (16,'李七','liqi@huawei.com','340211199301010016','18815650016','gaussdb_016');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (17,'李八','liba@huawei.com','340211199301010017','18815650017','gaussdb_017');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (18,'李九','lijiu@huawei.com','340211199301010018','18815650018','gaussdb_018');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (19,'王一','wangyi@huawei.com','340211199301010019','18815650019','gaussdb_019');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (20,'王二','wanger@huawei.com','340211199301010020','18815650020','gaussdb_020');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (21,'王三','wangsan@huawei.com','340211199301010021','18815650021','gaussdb_021');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (22,'王四','wangsi@huawei.com','340211199301010022','18815650022','gaussdb_022');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (23,'王五','wangwu@huawei.com','340211199301010023','18815650023','gaussdb_023');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (24,'王六','wangliu@huawei.com','340211199301010024','18815650024','gaussdb_024');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (25,'王七','wangqi@huawei.com','340211199301010025','18815650025','gaussdb_025');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (26,'王八','wangba@huawei.com','340211199301010026','18815650026','gaussdb_026');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (27,'王九','wangjiu@huawei.com','340211199301010027','18815650027','gaussdb_027');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (28,'钱一','qianyi@huawei.com','340211199301010028','18815650028','gaussdb_028');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (29,'钱二','qianer@huawei.com','340211199301010029','18815650029','gaussdb_029');
INSERT INTO client(c_id,c_name,c_mail,c_id_card,c_phone,c_password) VALUES (30,'钱三','qiansan@huawei.com','340211199301010030','18815650030','gaussdb_030');

#--bank_card
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000001','信用卡',1);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000002','信用卡',3);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000003','信用卡',5);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000004','信用卡',7);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000005','信用卡',9);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000006','信用卡',10);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000007','信用卡',12);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000008','信用卡',14);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000009','信用卡',16);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000010','信用卡',18);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000011','储蓄卡',19);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000012','储蓄卡',21);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000013','储蓄卡',7);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000014','储蓄卡',23);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000015','储蓄卡',24);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000016','储蓄卡',3);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000017','储蓄卡',26);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000018','储蓄卡',27);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000019','储蓄卡',12);
INSERT INTO bank_card(b_number,b_type,b_c_id) VALUES ('6222021302020000020','储蓄卡',29);


#--finances_product
INSERT INTO finances_product(p_name,p_id,p_description,p_amount,p_year) VALUES ('债券',1,'以国债、金融债、央行票据、企业债为主要投资方向的银行理财产品。',50000,6);
INSERT INTO finances_product(p_name,p_id,p_description,p_amount,p_year) VALUES ('信贷资产',2,'一般指银行作为委托人将通过发行理财产品募集资金委托给信托公司，信托公司作为受托人成立信托计划，将信托资产购买理财产品发售银行或第三方信贷资产。',50000,6);
INSERT INTO finances_product(p_name,p_id,p_description,p_amount,p_year) VALUES ('股票',3,'与股票挂钩的理财产品。目前市场上主要以港股挂钩居多',50000,6);
INSERT INTO finances_product(p_name,p_id,p_description,p_amount,p_year) VALUES ('大宗商品',4,'与大宗商品期货挂钩的理财产品。目前市场上主要以挂钩黄金、石油、农产品的理财产品居多。',50000,6);



#--insurance
INSERT INTO insurance(i_name,i_id,i_amount,i_person,i_year,i_project) VALUES ('健康保险',1,2000,'老人',30,'平安保险');
INSERT INTO insurance(i_name,i_id,i_amount,i_person,i_year,i_project) VALUES ('人寿保险',2,3000,'老人',30,'平安保险');
INSERT INTO insurance(i_name,i_id,i_amount,i_person,i_year,i_project) VALUES ('意外保险',3,5000,'所有人',30,'平安保险');
INSERT INTO insurance(i_name,i_id,i_amount,i_person,i_year,i_project) VALUES ('医疗保险',4,2000,'所有人',30,'平安保险');
INSERT INTO insurance(i_name,i_id,i_amount,i_person,i_year,i_project) VALUES ('财产损失保险',5,1500,'中年人',30,'平安保险');


#--fund
INSERT INTO fund(f_name,f_id,f_type,f_amount,risk_level,f_manager) VALUES ('股票',1,'股票型',10000,'高',1);
INSERT INTO fund(f_name,f_id,f_type,f_amount,risk_level,f_manager) VALUES ('投资',2,'债券型',10000,'中',2);
INSERT INTO fund(f_name,f_id,f_type,f_amount,risk_level,f_manager) VALUES ('国债',3,'货币型',10000,'低',3);
INSERT INTO fund(f_name,f_id,f_type,f_amount,risk_level,f_manager) VALUES ('沪深300指数',4,'指数型',10000,'中',4);


#--property
INSERT INTO property(pro_id,pro_c_id,pro_pif_id,pro_type,pro_status,pro_quantity,pro_income,pro_purchase_time) VALUES (1,5,1,1,'可用',4,8000,'2018-07-01');
INSERT INTO property(pro_id,pro_c_id,pro_pif_id,pro_type,pro_status,pro_quantity,pro_income,pro_purchase_time) VALUES (2,10,2,2,'可用',4,8000,'2018-07-01');
INSERT INTO property(pro_id,pro_c_id,pro_pif_id,pro_type,pro_status,pro_quantity,pro_income,pro_purchase_time) VALUES (3,15,3,3,'可用',4,8000,'2018-07-01');
INSERT INTO property(pro_id,pro_c_id,pro_pif_id,pro_type,pro_status,pro_quantity,pro_income,pro_purchase_time) VALUES (4,20,4,1,'冻结',4,8000,'2018-07-01');

 * mysql://stu2101213030:***@162.105.146.37:53306
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
###查询数据


#1.单表查询

#查询银行卡信息表。
%sql SELECT b_number,b_type FROM bank_card;

 * mysql://stu2101213030:***@162.105.146.37:53306
20 rows affected.

[('6222021302020000001', '信用卡'),
 ('6222021302020000002', '信用卡'),
 ('6222021302020000003', '信用卡'),
 ('6222021302020000004', '信用卡'),
 ('6222021302020000005', '信用卡'),
 ('6222021302020000006', '信用卡'),
 ('6222021302020000007', '信用卡'),
 ('6222021302020000008', '信用卡'),
 ('6222021302020000009', '信用卡'),
 ('6222021302020000010', '信用卡'),
 ('6222021302020000011', '储蓄卡'),
 ('6222021302020000012', '储蓄卡'),
 ('6222021302020000013', '储蓄卡'),
 ('6222021302020000014', '储蓄卡'),
 ('6222021302020000015', '储蓄卡'),
 ('6222021302020000016', '储蓄卡'),
 ('6222021302020000017', '储蓄卡'),
 ('6222021302020000018', '储蓄卡'),
 ('6222021302020000019', '储蓄卡'),
 ('6222021302020000020', '储蓄卡')]

In [14]:
#2.条件查询

#查询资产信息中‘可用’的资产数据。
%sql select * from property where pro_status='可用';

 * mysql://stu2101213030:***@162.105.146.37:53306
3 rows affected.

[(1, 5, 1, 1, '可用', 4, 8000, datetime.date(2018, 7, 1)),
 (2, 10, 2, 2, '可用', 4, 8000, datetime.date(2018, 7, 1)),
 (3, 15, 3, 3, '可用', 4, 8000, datetime.date(2018, 7, 1))]

In [15]:
#3.聚合查询。

# 查询用户表中有多少个用户。
%sql SELECT count(*) FROM client;

 * mysql://stu2101213030:***@162.105.146.37:53306
1 rows affected.

[(30,)]

In [16]:
# 查询银行卡信息表中，储蓄卡和信用卡的个数。
%sql SELECT b_type,COUNT(*) FROM finance.bank_card GROUP BY b_type;

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'bank_card'")
[SQL: SELECT b_type,COUNT(*) FROM finance.bank_card GROUP BY b_type;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [17]:
# 查询保险信息表中，保险金额的平均值。
%sql SELECT AVG(i_amount) FROM insurance;

 * mysql://stu2101213030:***@162.105.146.37:53306
1 rows affected.

[(Decimal('2700.0000'),)]

In [18]:
# 查询保险信息表中保险金额的最大值和最小值所对应的险种和金额。
query = """
select i_name,i_amount from finance.insurance where i_amount in (select max(i_amount) from finance.insurance)
union 
select i_name,i_amount from finance.insurance where i_amount in (select min(i_amount) from finance.insurance);
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'insurance'")
[SQL: select i_name,i_amount from finance.insurance where i_amount in (select max(i_amount) from finance.insurance) union select i_name,i_amount from finance.insurance where i_amount in (select min(i_amount) from finance.insurance);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [19]:
#4.连接查询

#半连接
# 查询用户编号在银行卡表中出现的用户的编号，用户姓名和身份证。
query = """
    SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id);
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'client'")
[SQL: SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [20]:
# 反连接
# 查询银行卡号不是‘622202130202000001*’（*表示未知）的用户的编号，姓名和身份证。

query = """
    SELECT c_id,c_name,c_id_card FROM finance.client WHERE c_id NOT IN (SELECT b_c_id FROM finance.bank_card WHERE b_number LIKE '622202130202000001_');
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'client'")
[SQL: SELECT c_id,c_name,c_id_card FROM finance.client WHERE c_id NOT IN (SELECT b_c_id FROM finance.bank_card WHERE b_number LIKE '622202130202000001_' );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [21]:
#5.子查询
# 通过子查询，查询保险产品中保险金额大于平均值的保险名称和适用人群。

query = """
    SELECT i1.i_name,i1.i_amount,i1.i_person FROM finance.insurance i1 WHERE i_amount > (SELECT avg(i_amount) FROM finance.insurance i2);
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'insurance'")
[SQL: SELECT i1.i_name,i1.i_amount,i1.i_person FROM finance.insurance i1 WHERE i_amount > (SELECT avg(i_amount) FROM finance.insurance i2);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [22]:
#6.ORDER BY和GROUP BY。

# 按照保额降序查询保险编号大于2的保险名称，保额和适用人群。

query = """
    SELECT i_name,i_amount,i_person FROM finance.insurance WHERE i_id>2 ORDER BY i_amount DESC;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'insurance'")
[SQL: SELECT i_name,i_amount,i_person FROM finance.insurance WHERE i_id>2 ORDER BY i_amount DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [23]:
# 查询各理财产品信息总数，按照p_year分组。
query = """
    SELECT p_year,count(p_id) FROM finance.finances_product GROUP BY p_year;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'finances_product'")
[SQL: SELECT p_year,count(p_id) FROM finance.finances_product GROUP BY p_year;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [24]:
#7.HAVING和WITH AS
# 查询保险金额统计数量等于2的适用人群数。
query = """
    SELECT i_person,count(i_amount) FROM finance.insurance GROUP BY i_person HAVING count(i_amount)=2;
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'insurance'")
[SQL: SELECT i_person,count(i_amount) FROM finance.insurance GROUP BY i_person HAVING count(i_amount)=2;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [25]:
# 使用WITH AS查询基金信息表。
query = """
    WITH temp AS (SELECT f_name,ln(f_amount) FROM finance.fund ORDER BY f_manager DESC) SELECT * FROM temp;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'fund'")
[SQL: WITH temp AS (SELECT f_name,ln(f_amount) FROM finance.fund ORDER BY f_manager DESC) SELECT * FROM temp;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [26]:
# 视图
# 针对“查询用户编号在银行卡表中出现的用户的编号，用户姓名和身份证” 的查询，创建视图。

query = """
    CREATE VIEW finance.v_client as SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id); 
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "CREATE VIEW command denied to user 'stu2101213030'@'172.17.0.1' for table 'v_client'")
[SQL: CREATE VIEW finance.v_client as SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [27]:
# 使用视图进行查询。
query = """
    SELECT * FROM finance.v_client;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'v_client'")
[SQL: SELECT * FROM finance.v_client;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [28]:
# 修改视图，在原有查询的基础上，过滤出信用卡用户。
query = """
    CREATE OR REPLACE VIEW finance.v_client as SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id and bank_card.b_type='信用卡');
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "CREATE VIEW command denied to user 'stu2101213030'@'172.17.0.1' for table 'v_client'")
[SQL: CREATE OR REPLACE VIEW finance.v_client as SELECT c_id,c_name,c_id_card FROM finance.client WHERE EXISTS (SELECT * FROM finance.bank_card WHERE client.c_id = bank_card.b_c_id and bank_card.b_type='信用卡');]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [29]:
# 使用视图进行查询。
query = """
    select * from finance.v_client;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'v_client'")
[SQL: select * from finance.v_client;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [30]:
# 删除视图。
query = """
    DROP VIEW finance.v_client;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "DROP command denied to user 'stu2101213030'@'172.17.0.1' for table 'v_client'")
[SQL: DROP VIEW finance.v_client;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [31]:
# 数据的修改和删除

# 修改/更新银行卡信息表中b_c_id小于10和客户信息表中c_id相同的记录的b_type字段。
# (1)查询原始数据
query = """
    SELECT * FROM finance.bank_card where b_c_id<10 ORDER BY b_c_id;
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'bank_card'")
[SQL: SELECT * FROM finance.bank_card where b_c_id<10 ORDER BY b_c_id;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [32]:
# (2)开始更新数据
query = """
    UPDATE finance.bank_card SET bank_card.b_type='借记卡' 
    where bank_card.b_c_id<10 
    and bank_card.b_c_id in (select c_id from client);
"""
%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "UPDATE command denied to user 'stu2101213030'@'172.17.0.1' for table 'bank_card'")
[SQL: UPDATE finance.bank_card SET bank_card.b_type='借记卡' where bank_card.b_c_id<10 and bank_card.b_c_id in (select c_id from client);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [33]:
# (3)重新查询数据情况。
query = """
    SELECT * FROM finance.bank_card ORDER BY b_c_id;
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'bank_card'")
[SQL: SELECT * FROM finance.bank_card ORDER BY b_c_id;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [34]:
# 删除基金信息表中编号小于3的行。
# (1)删除前查询结果。
query = """
    SELECT * FROM finance.fund;
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'fund'")
[SQL: SELECT * FROM finance.fund;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [35]:
# （2）开始删除数据：
query ="""
    DELETE FROM finance.fund WHERE f_id<3;
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "DELETE command denied to user 'stu2101213030'@'172.17.0.1' for table 'fund'")
[SQL: DELETE FROM finance.fund WHERE f_id<3;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [36]:
# （2）查询删除结果。

query ="""
    SELECT * FROM finance.fund;
"""

%sql $query

 * mysql://stu2101213030:***@162.105.146.37:53306
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'stu2101213030'@'172.17.0.1' for table 'fund'")
[SQL: SELECT * FROM finance.fund;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)